#include "stm32f10x.h"

int main()
{
//	//绿灯
//	//打开GPIOB端口的时钟 
//	*(unsigned int *) 0x40021018 |=((1)<<3);
//	
//	//配置ODR寄存器	(端口输出数据寄存器）											清零操作
//  *(unsigned int *)0x40010C0C &=~(1<<0);//0x40010C0C在编译器看来是一个立即数，如果要让编译器将其看做是一个地址，就必须进行强制类型转换
//	
//	//配置IO口为输出											置1操作
//	*(unsigned int *)0x40010C00 |=((1)<<(4*0));//(4*0) 4个为一组
	
	
	RCC_APB2ENR |=((1)<<3);
	
	
	
	GPIOB_ODR	 &=~(1<<0);
	
	//配置IO口为输出
	GPIOB_CRL	&=~((0x0f)<<(4*0));//先全部清零
	GPIOB_CRL	|=((1)<<(4*0));
}
void SystemInit()
{
    //函数体为空，目的是为了骗过编译器不报错
}

